package Lesson1_HomeWork;
/*
// Задание 2

public class Task2 {

    // Простые числа
    int integerValue = 2000;
    long longValue = 10000000;
    byte byteValue = -100;
    short shortValue = -30000;

    // Числа с плавающей точкой
    double doubleValue = 2.3d;
    float floatValue = 2.2f;

    // Символы
    char ch1 = 'п';

    // Строка
    String stringValue = "Привет, народ!";

    // boolean = true or false
    boolean booleanValue = true;

    // Остаток от деления
    int summ = 17 % 4;

    // Инкременты
    int summ1 = 16++; // Увеличение на 1. Входная переменная неизменна
    int summ1 = ++16; // Увеличение на 1. Входная переменная увеличивается на +1
System.out.println(summ1++); // Увеличение на 1. Входная переменная неизменна
System.out.println(++summ1);

    // Декременты
    int summ2 = 17;
System.out.println(summ2--); // Уменьшение на 1. Входная переменная неизменна
System.out.println(--summ2); // Уменьшение на 1. Входная переменная уменьшается на -1

    // Сложение с присваиванием
    int summ3 = 4 += 22;

    // Вычитание с присваиванием
    int summ4 = 43 -= 22;

    // Умножение с присваиванием
    int summ5 = 43 *= 22;

    // Деление с присваиванием
    int summ6 = 43 /= 22;

    // Деление с остатком с присваиванием
    int summ7 = 43 %= 22;

}


 */
